#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/natebay-aws/aws-jenkins-build-server/runs/run-CFjwjeRt1t9LW54D

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_kms_key.efs_kms_key will be created
  + resource "aws_kms_key" "efs_kms_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key used to encrypt Jenkins EFS volume"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

  # module.acm.aws_acm_certificate.this[0] will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "jenkins-controller.natebayaws.cloud"
      + domain_validation_options = [
          + {
              + domain_name           = "jenkins-controller.natebayaws.cloud"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags                      = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + tags_all                  = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.acm.aws_acm_certificate_validation.this[0] will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.acm.aws_route53_record.validation[0] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z08283091JJ6X8ITV69S6"
    }

  # module.serverless_jenkins.data.aws_iam_policy_document.efs_resource_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "efs_resource_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "elasticfilesystem:ClientMount",
              + "elasticfilesystem:ClientRootAccess",
              + "elasticfilesystem:ClientWrite",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "Bool"
              + values   = [
                  + "true",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::212329472425:root",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.serverless_jenkins.data.aws_iam_policy_document.jenkins_controller_task_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "jenkins_controller_task_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecs:ListContainerInstances",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ecs:RunTask",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ecs:us-west-2:212329472425:task-definition/*",
            ]

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "ecs:cluster"
            }
        }
      + statement {
          + actions   = [
              + "ecs:DescribeTasks",
              + "ecs:StopTask",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ecs:us-west-2:212329472425:task/*",
            ]

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "ecs:cluster"
            }
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
              + "ssm:PutParameter",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:us-west-2:212329472425:parameter/jenkins*",
            ]
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:kms:us-west-2:212329472425:alias/aws/ssm",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:iam::212329472425:role/*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:GetAuthorizationToken",
              + "ecr:GetDownloadUrlForLayer",
              + "ecs:DeregisterTaskDefinition",
              + "ecs:DescribeContainerInstances",
              + "ecs:DescribeTaskDefinition",
              + "ecs:ListClusters",
              + "ecs:ListTaskDefinitions",
              + "ecs:RegisterTaskDefinition",
              + "elasticfilesystem:ClientMount",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "elasticfilesystem:ClientRootAccess",
              + "elasticfilesystem:ClientWrite",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.serverless_jenkins.data.template_file.jenkins_configuration_def will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "jenkins_configuration_def"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            jenkins:
                systemMessage: "Amazon Fargate Demo"
                numExecutors: 0
                remotingSecurity:
                  enabled: true
                agentProtocols:
                    - "JNLP4-connect"
                securityRealm:
                    local:
                        allowsSignup: false
                        users:
                            - id: ecsuser
                              password: \$${ADMIN_PWD}
                authorizationStrategy:
                    globalMatrix:
                        grantedPermissions:
                            - "Overall/Read:authenticated"
                            - "Job/Read:authenticated"
                            - "View/Read:authenticated"
                            - "Overall/Administer:authenticated"
                crumbIssuer: "standard"
                slaveAgentPort: 50000
                clouds:
                    # - ecs:
                    #       allowedOverrides: "inheritFrom,label,memory,cpu,image"
                    #       credentialsId: ""
                    #       cluster: ${ecs_cluster_fargate_spot}
                    #       name: "fargate-cloud-spot"
                    #       regionName: ${cluster_region}
                    #       retentionTimeout: 10
                    #       jenkinsUrl: "http://${jenkins_cloud_map_name}:${jenkins_controller_port}"
                    #       templates:
                    #           - cpu: "512"
                    #             image: "jenkins/inbound-agent"
                    #             label: "build-spot"
                    #             executionRole: ${execution_role_arn}
                    #             launchType: "FARGATE"
                    #             memory: 0
                    #             memoryReservation: 1024
                    #             networkMode: "awsvpc"
                    #             privileged: false
                    #             remoteFSRoot: "/home/jenkins"
                    #             securityGroups: ${agent_security_groups}
                    #             sharedMemorySize: 0
                    #             subnets: ${subnets}
                    #             templateName: "build"
                    #             uniqueRemoteFSRoot: false
                    - ecs:
                          allowedOverrides: "inheritFrom,label,memory,cpu,image"
                          credentialsId: ""
                          cluster: ${ecs_cluster_fargate}
                          name: "fargate-cloud"
                          regionName: ${cluster_region}
                          retentionTimeout: 10
                          jenkinsUrl: "http://${jenkins_cloud_map_name}:${jenkins_controller_port}"
                          templates:
                              - cpu: "512"
                                image: "jenkins/inbound-agent"
                                label: "build"
                                executionRole: ${execution_role_arn}
                                launchType: "FARGATE"
                                memory: 0
                                memoryReservation: 1024
                                networkMode: "awsvpc"
                                privileged: false
                                remoteFSRoot: "/home/jenkins"
                                securityGroups: ${agent_security_groups}
                                sharedMemorySize: 0
                                subnets: ${subnets}
                                templateName: "build"
                                uniqueRemoteFSRoot: false
            security:
              sSHD:
                port: -1
            jobs:
              - script: >
                  pipelineJob('Simple job critical task') {
                    definition {
                      cps {
                        script('''
                          pipeline {
                              agent {
                                  ecs {
                                      inheritFrom 'build'
                                  }
                              }
                              stages {
                                stage('Test') {
                                    steps {
                                        script {
                                            sh "echo this was executed on non spot instance"
                                        }
                                        sh 'sleep 120'
                                        sh 'echo sleep is done'
                                    }
                                }
                              }
                          }'''.stripIndent())
                          sandbox()
                      }
                    }
                  }
              # - script: >
              #     pipelineJob('Simple job non critical task') {
              #       definition {
              #         cps {
              #           script('''
              #             pipeline {
              #                 agent {
              #                     ecs {
              #                         inheritFrom 'build-spot'
              #                     }
              #                 }
              #                 stages {
              #                   stage('Test') {
              #                       steps {
              #                           script {
              #                               sh "echo this was executed on a spot instance"
              #                           }
              #                           sh 'sleep 120'
              #                           sh 'echo sleep is done'
              #                       }
              #                   }
              #                 }
              #             }'''.stripIndent())
              #             sandbox()
              #         }
              #       }
              #     }
        EOT
      + vars     = {
          + "agent_security_groups"   = (known after apply)
          + "cluster_region"          = "us-west-2"
          + "ecs_cluster_fargate"     = (known after apply)
          + "execution_role_arn"      = (known after apply)
          + "jenkins_cloud_map_name"  = "controller.serverless-jenkins"
          + "jenkins_controller_port" = "8080"
          + "jnlp_port"               = "50000"
          + "subnets"                 = "subnet-082823527a66dfb03,subnet-01ead1fb0854f8abc"
        }
    }

  # module.serverless_jenkins.aws_cloudwatch_log_group.jenkins_controller_log_group will be created
  + resource "aws_cloudwatch_log_group" "jenkins_controller_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + name              = "serverless-jenkins"
      + retention_in_days = 14
      + tags              = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + tags_all          = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
    }

  # module.serverless_jenkins.aws_ecr_repository.jenkins_controller will be created
  + resource "aws_ecr_repository" "jenkins_controller" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "serverless-jenkins-controller"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.serverless_jenkins.aws_ecr_repository_policy.this will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:UploadLayerPart",
                          + "ecr:SetRepositoryPolicy",
                          + "ecr:PutImage",
                          + "ecr:ListImages",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:DescribeRepositories",
                          + "ecr:DeleteRepositoryPolicy",
                          + "ecr:DeleteRepository",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchDeleteImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::212329472425:root"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "serverless-jenkins-controller"
    }

  # module.serverless_jenkins.aws_ecs_cluster.jenkins_controller will be created
  + resource "aws_ecs_cluster" "jenkins_controller" {
      + arn                = (known after apply)
      + capacity_providers = [
          + "FARGATE",
        ]
      + id                 = (known after apply)
      + name               = "serverless-jenkins-main"
      + tags               = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + tags_all           = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.serverless_jenkins.aws_ecs_service.jenkins_controller will be created
  + resource "aws_ecs_service" "jenkins_controller" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 100
      + deployment_minimum_healthy_percent = 0
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "serverless-jenkins-controller"
      + platform_version                   = "1.4.0"
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "serverless-jenkins-controller"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-01ead1fb0854f8abc",
              + "subnet-082823527a66dfb03",
            ]
        }

      + service_registries {
          + port         = 50000
          + registry_arn = (known after apply)
        }
    }

  # module.serverless_jenkins.aws_ecs_task_definition.jenkins_controller will be created
  + resource "aws_ecs_task_definition" "jenkins_controller" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "2048"
      + execution_role_arn       = (known after apply)
      + family                   = "serverless-jenkins"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + tags_all                 = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + task_role_arn            = (known after apply)

      + volume {
          + name = "serverless-jenkins-efs"

          + efs_volume_configuration {
              + file_system_id     = (known after apply)
              + root_directory     = "/"
              + transit_encryption = "ENABLED"

              + authorization_config {
                  + access_point_id = (known after apply)
                  + iam             = "ENABLED"
                }
            }
        }
    }

  # module.serverless_jenkins.aws_efs_access_point.this will be created
  + resource "aws_efs_access_point" "this" {
      + arn             = (known after apply)
      + file_system_arn = (known after apply)
      + file_system_id  = (known after apply)
      + id              = (known after apply)
      + owner_id        = (known after apply)
      + tags            = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + tags_all        = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }

      + posix_user {
          + gid = 0
          + uid = 0
        }

      + root_directory {
          + path = "/"

          + creation_info {
              + owner_gid   = 1000
              + owner_uid   = 1000
              + permissions = "755"
            }
        }
    }

  # module.serverless_jenkins.aws_efs_file_system.this will be created
  + resource "aws_efs_file_system" "this" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = "serverless-jenkins-fs"
      + dns_name                = (known after apply)
      + encrypted               = true
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = "generalPurpose"
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + tags_all                = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + throughput_mode         = "bursting"

      + lifecycle_policy {
          + transition_to_ia = "AFTER_14_DAYS"
        }
    }

  # module.serverless_jenkins.aws_efs_file_system_policy.this will be created
  + resource "aws_efs_file_system_policy" "this" {
      + bypass_policy_lockout_safety_check = false
      + file_system_id                     = (known after apply)
      + id                                 = (known after apply)
      + policy                             = (known after apply)
    }

  # module.serverless_jenkins.aws_efs_mount_target.this["subnet-01ead1fb0854f8abc"] will be created
  + resource "aws_efs_mount_target" "this" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = "subnet-01ead1fb0854f8abc"
    }

  # module.serverless_jenkins.aws_efs_mount_target.this["subnet-082823527a66dfb03"] will be created
  + resource "aws_efs_mount_target" "this" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = "subnet-082823527a66dfb03"
    }

  # module.serverless_jenkins.aws_iam_policy.ecs_execution_policy will be created
  + resource "aws_iam_policy" "ecs_execution_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "serverless-jenkins-ecs-execution-policy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.serverless_jenkins.aws_iam_policy.jenkins_controller_task_policy will be created
  + resource "aws_iam_policy" "jenkins_controller_task_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "serverless-jenkins-controller-task-policy"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.serverless_jenkins.aws_iam_role.ecs_execution_role will be created
  + resource "aws_iam_role" "ecs_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "serverless-jenkins-ecs-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + tags_all              = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.serverless_jenkins.aws_iam_role.jenkins_controller_task_role will be created
  + resource "aws_iam_role" "jenkins_controller_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "serverless-jenkins-controller-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + tags_all              = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.serverless_jenkins.aws_iam_role_policy_attachment.ecs_execution will be created
  + resource "aws_iam_role_policy_attachment" "ecs_execution" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "serverless-jenkins-ecs-execution-role"
    }

  # module.serverless_jenkins.aws_iam_role_policy_attachment.jenkins_controller_task will be created
  + resource "aws_iam_role_policy_attachment" "jenkins_controller_task" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "serverless-jenkins-controller-task-role"
    }

  # module.serverless_jenkins.aws_kms_key.cloudwatch will be created
  + resource "aws_kms_key" "cloudwatch" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS for cloudwatch log group"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "key-policy-cloudwatch"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::212329472425:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt*",
                          + "kms:Describe*",
                          + "kms:Decrypt*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.us-west-2.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "AllowCloudWatchLogs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags_all                           = (known after apply)
    }

  # module.serverless_jenkins.aws_lb.this will be created
  + resource "aws_lb" "this" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "serverless-jenkins-crtl-alb"
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-01ea73f369a51bcd5",
          + "subnet-04e026aa71cda0f0f",
        ]
      + tags                       = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + tags_all                   = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.serverless_jenkins.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.serverless_jenkins.aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-FS-1-2-Res-2019-08"
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.serverless_jenkins.aws_lb_listener_rule.redirect_http_to_https will be created
  + resource "aws_lb_listener_rule" "redirect_http_to_https" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + condition {

          + http_header {
              + http_header_name = "*"
              + values           = [
                  + "*",
                ]
            }
        }
    }

  # module.serverless_jenkins.aws_lb_target_group.this will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "serverless-jenkins-crtl"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + tags_all                           = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-4ff8bc37"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/login"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.serverless_jenkins.aws_route53_record.this[0] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "jenkins-controller"
      + type            = "A"
      + zone_id         = "Z08283091JJ6X8ITV69S6"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.serverless_jenkins.aws_security_group.alb_security_group[0] will be created
  + resource "aws_security_group" "alb_security_group" {
      + arn                    = (known after apply)
      + description            = "serverless-jenkins alb security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "18.213.118.224/32",
                ]
              + description      = "HTTP Public access"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "18.213.118.224/32",
                ]
              + description      = "HTTPS Public access"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "serverless-jenkins-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + tags_all               = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + vpc_id                 = "vpc-4ff8bc37"
    }

  # module.serverless_jenkins.aws_security_group.efs_security_group will be created
  + resource "aws_security_group" "efs_security_group" {
      + arn                    = (known after apply)
      + description            = "serverless-jenkins efs security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 2049
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 2049
            },
        ]
      + name                   = "serverless-jenkins-efs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + tags_all               = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + vpc_id                 = "vpc-4ff8bc37"
    }

  # module.serverless_jenkins.aws_security_group.jenkins_controller_security_group will be created
  + resource "aws_security_group" "jenkins_controller_security_group" {
      + arn                    = (known after apply)
      + description            = "serverless-jenkins controller security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Communication channel to jenkins leader"
              + from_port        = 50000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = true
              + to_port          = 50000
            },
          + {
              + cidr_blocks      = []
              + description      = "Communication channel to jenkins leader"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = true
              + to_port          = 8080
            },
        ]
      + name                   = "serverless-jenkins-controller"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + tags_all               = {
          + "solution" = "jenkins"
          + "team"     = "devops"
        }
      + vpc_id                 = "vpc-4ff8bc37"
    }

  # module.serverless_jenkins.aws_service_discovery_private_dns_namespace.controller will be created
  + resource "aws_service_discovery_private_dns_namespace" "controller" {
      + arn         = (known after apply)
      + description = "Serverless Jenkins discovery managed zone."
      + hosted_zone = (known after apply)
      + id          = (known after apply)
      + name        = "serverless-jenkins"
      + tags_all    = (known after apply)
      + vpc         = "vpc-4ff8bc37"
    }

  # module.serverless_jenkins.aws_service_discovery_service.controller will be created
  + resource "aws_service_discovery_service" "controller" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "controller"
      + namespace_id  = (known after apply)
      + tags_all      = (known after apply)

      + dns_config {
          + namespace_id   = (known after apply)
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 10
              + type = "A"
            }
          + dns_records {
              + ttl  = 10
              + type = "SRV"
            }
        }

      + health_check_custom_config {
          + failure_threshold = 5
        }
    }

  # module.serverless_jenkins.null_resource.build_docker_image will be created
  + resource "null_resource" "build_docker_image" {
      + id       = (known after apply)
      + triggers = {
          + "src_hash" = <<-EOT
                jenkins:
                    systemMessage: "Amazon Fargate Demo"
                    numExecutors: 0
                    remotingSecurity:
                      enabled: true
                    agentProtocols:
                        - "JNLP4-connect"
                    securityRealm:
                        local:
                            allowsSignup: false
                            users:
                                - id: ecsuser
                                  password: \$${ADMIN_PWD}
                    authorizationStrategy:
                        globalMatrix:
                            grantedPermissions:
                                - "Overall/Read:authenticated"
                                - "Job/Read:authenticated"
                                - "View/Read:authenticated"
                                - "Overall/Administer:authenticated"
                    crumbIssuer: "standard"
                    slaveAgentPort: 50000
                    clouds:
                        # - ecs:
                        #       allowedOverrides: "inheritFrom,label,memory,cpu,image"
                        #       credentialsId: ""
                        #       cluster: ${ecs_cluster_fargate_spot}
                        #       name: "fargate-cloud-spot"
                        #       regionName: ${cluster_region}
                        #       retentionTimeout: 10
                        #       jenkinsUrl: "http://${jenkins_cloud_map_name}:${jenkins_controller_port}"
                        #       templates:
                        #           - cpu: "512"
                        #             image: "jenkins/inbound-agent"
                        #             label: "build-spot"
                        #             executionRole: ${execution_role_arn}
                        #             launchType: "FARGATE"
                        #             memory: 0
                        #             memoryReservation: 1024
                        #             networkMode: "awsvpc"
                        #             privileged: false
                        #             remoteFSRoot: "/home/jenkins"
                        #             securityGroups: ${agent_security_groups}
                        #             sharedMemorySize: 0
                        #             subnets: ${subnets}
                        #             templateName: "build"
                        #             uniqueRemoteFSRoot: false
                        - ecs:
                              allowedOverrides: "inheritFrom,label,memory,cpu,image"
                              credentialsId: ""
                              cluster: ${ecs_cluster_fargate}
                              name: "fargate-cloud"
                              regionName: ${cluster_region}
                              retentionTimeout: 10
                              jenkinsUrl: "http://${jenkins_cloud_map_name}:${jenkins_controller_port}"
                              templates:
                                  - cpu: "512"
                                    image: "jenkins/inbound-agent"
                                    label: "build"
                                    executionRole: ${execution_role_arn}
                                    launchType: "FARGATE"
                                    memory: 0
                                    memoryReservation: 1024
                                    networkMode: "awsvpc"
                                    privileged: false
                                    remoteFSRoot: "/home/jenkins"
                                    securityGroups: ${agent_security_groups}
                                    sharedMemorySize: 0
                                    subnets: ${subnets}
                                    templateName: "build"
                                    uniqueRemoteFSRoot: false
                security:
                  sSHD:
                    port: -1
                jobs:
                  - script: >
                      pipelineJob('Simple job critical task') {
                        definition {
                          cps {
                            script('''
                              pipeline {
                                  agent {
                                      ecs {
                                          inheritFrom 'build'
                                      }
                                  }
                                  stages {
                                    stage('Test') {
                                        steps {
                                            script {
                                                sh "echo this was executed on non spot instance"
                                            }
                                            sh 'sleep 120'
                                            sh 'echo sleep is done'
                                        }
                                    }
                                  }
                              }'''.stripIndent())
                              sandbox()
                          }
                        }
                      }
                  # - script: >
                  #     pipelineJob('Simple job non critical task') {
                  #       definition {
                  #         cps {
                  #           script('''
                  #             pipeline {
                  #                 agent {
                  #                     ecs {
                  #                         inheritFrom 'build-spot'
                  #                     }
                  #                 }
                  #                 stages {
                  #                   stage('Test') {
                  #                       steps {
                  #                           script {
                  #                               sh "echo this was executed on a spot instance"
                  #                           }
                  #                           sh 'sleep 120'
                  #                           sh 'echo sleep is done'
                  #                       }
                  #                   }
                  #                 }
                  #             }'''.stripIndent())
                  #             sandbox()
                  #         }
                  #       }
                  #     }
            EOT
        }
    }

  # module.serverless_jenkins.null_resource.render_template will be created
  + resource "null_resource" "render_template" {
      + id       = (known after apply)
      + triggers = {
          + "src_hash" = <<-EOT
                jenkins:
                    systemMessage: "Amazon Fargate Demo"
                    numExecutors: 0
                    remotingSecurity:
                      enabled: true
                    agentProtocols:
                        - "JNLP4-connect"
                    securityRealm:
                        local:
                            allowsSignup: false
                            users:
                                - id: ecsuser
                                  password: \$${ADMIN_PWD}
                    authorizationStrategy:
                        globalMatrix:
                            grantedPermissions:
                                - "Overall/Read:authenticated"
                                - "Job/Read:authenticated"
                                - "View/Read:authenticated"
                                - "Overall/Administer:authenticated"
                    crumbIssuer: "standard"
                    slaveAgentPort: 50000
                    clouds:
                        # - ecs:
                        #       allowedOverrides: "inheritFrom,label,memory,cpu,image"
                        #       credentialsId: ""
                        #       cluster: ${ecs_cluster_fargate_spot}
                        #       name: "fargate-cloud-spot"
                        #       regionName: ${cluster_region}
                        #       retentionTimeout: 10
                        #       jenkinsUrl: "http://${jenkins_cloud_map_name}:${jenkins_controller_port}"
                        #       templates:
                        #           - cpu: "512"
                        #             image: "jenkins/inbound-agent"
                        #             label: "build-spot"
                        #             executionRole: ${execution_role_arn}
                        #             launchType: "FARGATE"
                        #             memory: 0
                        #             memoryReservation: 1024
                        #             networkMode: "awsvpc"
                        #             privileged: false
                        #             remoteFSRoot: "/home/jenkins"
                        #             securityGroups: ${agent_security_groups}
                        #             sharedMemorySize: 0
                        #             subnets: ${subnets}
                        #             templateName: "build"
                        #             uniqueRemoteFSRoot: false
                        - ecs:
                              allowedOverrides: "inheritFrom,label,memory,cpu,image"
                              credentialsId: ""
                              cluster: ${ecs_cluster_fargate}
                              name: "fargate-cloud"
                              regionName: ${cluster_region}
                              retentionTimeout: 10
                              jenkinsUrl: "http://${jenkins_cloud_map_name}:${jenkins_controller_port}"
                              templates:
                                  - cpu: "512"
                                    image: "jenkins/inbound-agent"
                                    label: "build"
                                    executionRole: ${execution_role_arn}
                                    launchType: "FARGATE"
                                    memory: 0
                                    memoryReservation: 1024
                                    networkMode: "awsvpc"
                                    privileged: false
                                    remoteFSRoot: "/home/jenkins"
                                    securityGroups: ${agent_security_groups}
                                    sharedMemorySize: 0
                                    subnets: ${subnets}
                                    templateName: "build"
                                    uniqueRemoteFSRoot: false
                security:
                  sSHD:
                    port: -1
                jobs:
                  - script: >
                      pipelineJob('Simple job critical task') {
                        definition {
                          cps {
                            script('''
                              pipeline {
                                  agent {
                                      ecs {
                                          inheritFrom 'build'
                                      }
                                  }
                                  stages {
                                    stage('Test') {
                                        steps {
                                            script {
                                                sh "echo this was executed on non spot instance"
                                            }
                                            sh 'sleep 120'
                                            sh 'echo sleep is done'
                                        }
                                    }
                                  }
                              }'''.stripIndent())
                              sandbox()
                          }
                        }
                      }
                  # - script: >
                  #     pipelineJob('Simple job non critical task') {
                  #       definition {
                  #         cps {
                  #           script('''
                  #             pipeline {
                  #                 agent {
                  #                     ecs {
                  #                         inheritFrom 'build-spot'
                  #                     }
                  #                 }
                  #                 stages {
                  #                   stage('Test') {
                  #                       steps {
                  #                           script {
                  #                               sh "echo this was executed on a spot instance"
                  #                           }
                  #                           sh 'sleep 120'
                  #                           sh 'echo sleep is done'
                  #                       }
                  #                   }
                  #                 }
                  #             }'''.stripIndent())
                  #             sandbox()
                  #         }
                  #       }
                  #     }
            EOT
        }
    }

Plan: 35 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + jenkins_fargate_efs = {
      + efs_access_point_id       = (known after apply)
      + efs_aws_backup_plan_name  = []
      + efs_aws_backup_vault_name = []
      + efs_file_system_dns_name  = (known after apply)
      + efs_file_system_id        = (known after apply)
      + efs_security_group_id     = (known after apply)
    }
╷
│ Warning: Argument is deprecated
│ 
│   with module.serverless_jenkins.aws_ecs_cluster.jenkins_controller,
│   on modules/jenkins/ecs.tf line 4, in resource "aws_ecs_cluster" "jenkins_controller":
│    4:   capacity_providers = ["FARGATE"]
│ 
│ Use the aws_ecs_cluster_capacity_providers resource instead
│ 
│ (and one more similar warning elsewhere)
╵

------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 10 estimated
           $18.74000000000000544/mo +$18.74000000000000544

```

</details>

*Pusher: @goudhabuddha, Action: `pull_request`*